{
    "format": "layers-model",
    "generatedBy": "keras js v1.0.0",
    "convertedBy": "TensorFlow.js Converter v1.0.0",
    "modelTopology": {
        "keras_version": "2.2.4",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "batch_input_shape": [null, 224, 224, 3],
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [3, 3],
                            "strides": [1, 1],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [1, 1],
                            "activation": "relu",
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [2, 2],
                            "padding": "valid",
                            "strides": [2, 2],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_1",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 9,
                            "activation": "softmax",
                            "use_bias": true
                        }
                    }
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["model.weights.bin"],
            "weights": []
        }
    ]
} 